<script setup>
import ApplicationLayout from "@/Layouts/ApplicationLayout.vue";
import {Head, Link} from "@inertiajs/vue3";
import Sidebar from "@/Common/Sidebar.vue";
import Breadcrumbs from "@/Components/Breadcrumbs.vue";
</script>

<template>
    <Head title="Большая коллекция разных сутр"/>
    <ApplicationLayout>
        <div class="flex flex-col lg:flex-row">
            <div class="flex flex-col lg:flex-row w-full">
                <div class="bg-white p-4 w-full">

                    <Breadcrumbs :items="[
                        {title: 'Дерге Кангьюр', url: '/kangyur'},
                    ]" class="mb-1"/>

                    <div class="font-serif text-2xl mb-6">Большая коллекция разных сутр</div>

                    <p class="my-4">
                        Считается, что многие из этих работ циркулировали в Тибете в течение веков, предшествовавших
                        развитию и созданию различных Кангьюров, в виде различных сборников сутр под названием mdo mang,
                        некоторые из которых дошли до наших дней.
                    </p>

                    <p class="my-4">
                        Согласно каталогу Дерге Кангьюр, работы в этом разделе расположены так: сначала идут сутры
                        Махаяны (Toh 94-286), затем сутры Шравакаяны (Toh 287-359).
                    </p>

                    <p class="my-4">
                        Сутры в этом разделе «Общие сутры» имеют множество различных форм. Многие из них представляют
                        собой диалоги между Буддой и отдельными учениками, будь то бодхисаттвы, цари, простые мужчины и
                        женщины, боги или наги. Некоторые из них представляют собой учения, которые Будда давал по
                        определенному поводу и на определенные темы. Иногда они рассказывают о чудесных проявлениях,
                        описывают возвышенные состояния самадхи, учения, данные буддами в других мирах, подробные списки
                        этических или философских моментов для размышления, краткие изложения важных доктрин, объяснения
                        прошлых жизней отдельных людей или предсказания их будущего пробуждения и т. д. Часто они
                        включают несколько таких элементов в одно произведение.
                    </p>
                </div>
            </div>

            <div class="lg:ml-4 lg:w-96">
                <Sidebar/>
            </div>
        </div>

    </ApplicationLayout>
</template>
