<script setup>
import {Head, Link} from '@inertiajs/vue3';
import ApplicationLayout from '@/Layouts/ApplicationLayout.vue';
import Sidebar from "@/Common/Sidebar.vue";
import Participants from "@/Components/Participants.vue";
</script>

<template>
    <Head title="Новости"/>

    <ApplicationLayout>

        <div class="flex flex-col md:flex-row">
            <div class="flex flex-col w-full">

                <div class="bg-white p-4 w-full">

                    <h1 class="py-4">О фонде</h1>
                    <p>
                        “Фонд канона буддизма” является полностью некоммерческой организацией и вся работа выполняется волонтерами бесплатно. <br />
                        Это наш подарок всему человечеству.
                    </p>

                    <h2 class="py-4">Наша задача предоставить доступ к канонам буддизмa</h2>
                    <p>
                        <ul class="list-disc px-4">
                            <li>в формате удобном для чтения;</li>
                            <li>полностью бесплатно;</li>
                            <li>с переводами на разных языках, включая оригинал;</li>
                            <li>без ограничений авторскими правами;</li>
                            <li>с открытой лицензией и свободный для распространения в любом виде;</li>
                            <li>не принадлежащий ни одному сообществу, традиции или школе;</li>
                            <li>без каких-либо лишних материалов, только каноны всех традиций.</li>
                        </ul>
                    </p>

                    <h2 class="py-4">О переводах</h2>
                    <p>
                        Переводы выполняются большим коллективом участников с постоянной перепроверкой и под редактурой
                        образованных мирян и монахов владеющих языками. Если вы нашли ошибку в переводе или опечатку, пожалуйста нажмите кнопку
                        “сообщить об ошибке перевода” в сутре / сутте. Если вы владеете на высоком уровне одним из языков и хотели бы
                        принять участие в работе Фонда как волонтёр, пожалуйста присоединяйтесь.
                    </p>

                    <h2 class="py-4">Почему web версия, а не печатная или электронная книга?</h2>
                    <p>
                        <ul class="list-disc px-4">
                            <li>это позволяет в несколько кликов вносить правки в переводы с целью их улучшения;</li>
                            <li>удобно отображать спорные моменты перевода;</li>
                            <li>удобнее управлять переключением языка и комментариями к текстам;</li>
                            <li>совместно работать большому коллективу;</li>
                            <li>избежать проблем переизданий и версий- сохранять доступ бесплатным для всех, так как цифровой формат не требует расходов на печать;</li>
                            <li>добавлять новые материалы и переводы по ходу их выполнения.</li>
                        </ul>
                    </p>

                    <p class="py-4">
                        Написать сообщение в фонд &nbsp;
                        <a href="https://t.me/nara_loka" target="_blank" class="bc-button p-1.5 inline-block">
                            <img src="/icon-telegram.svg" alt="telegram" class="w-6 h-6 min-w-6 inline-block" /> Телеграм
                        </a>
                    </p>

                </div>

                <div class="w-full p-4 pb-0">
                    <h3 class="text-center">Список участников</h3>
                </div>

                <Participants />
            </div>

            <div class="md:ml-4 md:w-96">
                <Sidebar/>
            </div>

        </div>


    </ApplicationLayout>
</template>
