<script setup>
import {Head, Link} from '@inertiajs/vue3';
import ApplicationLayout from '@/Layouts/ApplicationLayout.vue';
import Sidebar from "@/Common/Sidebar.vue";

const h2Class = 'mt-4 mb-2 text-2xl';
const h3Class = 'mt-4 mb-2 text-xl';
const pClass = 'mt-2 mb-2';
const ulClass = pClass;
const liClass = 'list-disc ml-4';
</script>

<template>
    <Head title="Пользовательское Соглашение"/>

    <ApplicationLayout>
        <div class="flex flex-col md:flex-row">
            <div class="flex flex-col lg:flex-row w-full">
                <div class="bg-white p-4 w-full">
                    <div class="mt-4 mb-4 font-serif text-4xl">Пользовательское Соглашение</div>

                    <p :class="pClass">Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем buddhistcanon.ru (далее ФОНД КАНОНА БУДДИЗМА или Администрация) с одной стороны и пользователем сайта с другой. Сайт ФОНД КАНОНА БУДДИЗМА не является средством массовой информации.</p>
                    <p :class="pClass">Используя сайт, Вы соглашаетесь с условиями данного соглашения. Если Вы не согласны с условиями данного соглашения, не используйте сайт ФОНД КАНОНА БУДДИЗМА!</p>

                    <h2 :class="h2Class">Предмет соглашения</h2>
                    <p :class="pClass">Администрация предоставляет пользователю право на размещение на сайте следующей информации:</p>
                    <ul :class="ulClass">
                        <li :class="liClass">Текстовой информации</li>
                        <li :class="liClass">Ссылок на материалы, размещенные на других сайтах</li>
                    </ul>

                    <h2 :class="h2Class">Права и обязанности сторон</h2>

                    <h3 :class="h3Class">Пользователь имеет право:</h3>
                    <ul :class="ulClass">
                        <li :class="liClass">осуществлять поиск информации на сайте</li>
                        <li :class="liClass">получать информацию на сайте</li>
                        <li :class="liClass">создавать информацию для сайта</li>
                        <li :class="liClass">распространять информацию на сайте</li>
                        <li :class="liClass">использовать информацию сайта в личных некоммерческих целях</li>
                        <li :class="liClass">использовать информацию сайта в коммерческих целях без специального разрешения</li>
                    </ul>

                    <h3 :class="h3Class">Администрация имеет право:</h3>
                    <ul :class="ulClass">
                        <li :class="liClass">по своему усмотрению и необходимости создавать, изменять, отменять правила</li>
                        <li :class="liClass">ограничивать доступ к любой информации на сайте</li>
                        <li :class="liClass">создавать, изменять, удалять информацию</li>
                        <li :class="liClass">удалять учетные записи</li>
                        <li :class="liClass">отказывать в регистрации без объяснения причин</li>
                    </ul>

                    <h3 :class="h3Class">Пользователь обязуется:</h3>
                    <ul :class="ulClass">
                        <li :class="liClass">обеспечить достоверность предоставляемой информации</li>
                        <li :class="liClass">обеспечивать сохранность личных данных от доступа третьих лиц</li>
                        <li :class="liClass">обновлять Персональные данные, предоставленные при регистрации, в случае их изменения</li>
                        <li :class="liClass">не распространять информацию, которая направлена на пропаганду войны, разжигание национальной, расовой или религиозной ненависти и вражды, а также иной информации, за распространение которой предусмотрена уголовная или административная ответственность</li>
                        <li :class="liClass">не нарушать работоспособность сайта</li>
                        <li :class="liClass">не совершать действия, направленные на введение других Пользователей в заблуждение</li>
                        <li :class="liClass">не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам</li>
                        <li :class="liClass">не регистрировать учетную запись от имени или вместо другого лица за исключением случаев, предусмотренных законодательством РФ</li>
                        <li :class="liClass">не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ</li>
                        <li :class="liClass">не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</li>
                    </ul>

                    <h3 :class="h3Class">Администрация обязуется:</h3>
                    <ul :class="ulClass">
                        <li :class="liClass">поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</li>
                        <li :class="liClass">осуществлять разностороннюю защиту учетной записи Пользователя</li>
                        <li :class="liClass">защищать информацию, распространение которой ограничено или запрещено законами путем вынесения предупреждения либо удалением учетной записи пользователя, нарушившего правила</li>
                        <li :class="liClass">предоставить всю доступную информацию о Пользователе уполномоченным на то органам государственной власти в случаях, установленных законом</li>
                    </ul>

                    <h2 :class="h2Class">Ответственность сторон</h2>
                    <ul :class="ulClass">
                        <li :class="liClass">пользователь лично несет полную ответственность за распространяемую им информацию</li>
                        <li :class="liClass">администрация не несет никакой ответственности за достоверность информации, скопированной из других источников</li>
                        <li :class="liClass">администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг</li>
                        <li :class="liClass">администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</li>
                        <li :class="liClass">в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</li>
                    </ul>

                    <h2 :class="h2Class">Условия действия Соглашения</h2>
                    <p :class="pClass">Данное Соглашение вступает в силу при любом использовании данного сайта.</p>
                    <p :class="pClass">Соглашение перестает действовать при появлении его новой версии.</p>
                    <p :class="pClass">Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.</p>
                    <p :class="pClass">Администрация не оповещает пользователей об изменении в Соглашении.</p>

                </div>
            </div>

            <div class="md:ml-4 md:w-96">
                <Sidebar/>
            </div>
        </div>
    </ApplicationLayout>
</template>
